Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཇི་ལྟར་ན་བདག་ཉི་མ་གང་ལ་མངོན་པར་བྱུང་བ་དེ་ཉིད་ཀྱི་ཉི་མ་ལ། ནག་པོའི་ཕྱོགས་འཁོར་དང་བཅས་པ་ཕམ་པར་བྱས་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱ་བར་བྱ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they should think, ‘How is it that I, on the very day on which I renounce the world, shall defeat the dark forces along with their entourage? {

source: མངོན་པར་སངས་རྒྱས་ནས་ནི་ཇི་ལྟར་ཉི་མ་དེ་ཉིད་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་བྱ།
en: Dt.34} How is it that I, having attained consummate buddhahood in unsurpassed, complete enlightenment, on that very day shall turn the wheel of the Dharma?

source: འཁོར་ལོ་བསྐོར་ནས་ནི་ཇི་ལྟར་ཚད་མེད་གྲངས་མེད་པའི་སེམས་ཅན་རྣམས་རྡུལ་དང་བྲལ་ཏེ། དྲི་མ་དང་བྲལ་ནས་ཆོས་ལ་ཆོས་ཀྱི་མིག་རྣམ་པར་དག་པར་བྱ།
en: How is it that I shall enable immeasurable, countless beings to purify the eye of the Dharma, taintless and immaculate, with respect to all phenomena?

source: ཚད་མེད་གྲངས་མེད་པའི་སེམས་ཅན་རྣམས་ནི་ཇི་ལྟར་ཉེ་བར་ལེན་པ་མེད་པར་ཟག་པ་རྣམས་ལས་སེམས་རྣམ་པར་གྲོལ་བར་བྱ།
en: How is it that I shall enable immeasurable, countless beings to be without further grasping and liberate their minds from contaminants?

source: ཚད་མེད་གྲངས་མེད་པའི་སེམས་ཅན་རྣམས་ནི་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་བྱ་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: How is it that I shall ensure that immeasurable, countless beings will make irreversible progress toward unsurpassed, complete enlightenment?’ And when they think such thoughts, they should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། འདི་ལྟར་སེམས་བསྐྱེད་པར་བྱ་སྟེ། ཇི་ལྟར་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ། ཉན་ཐོས་ཀྱི་དགེ་འདུན་ནི་ཚད་མེད་གྲངས་མེད་པར་འགྱུར།
en: Moreover, Śāradvatīputra, when bodhisattva great beings practice the perfection of wisdom, they should set their minds on enlightenment, thinking, ‘How is it that I, when I have attained consummate buddhahood in unsurpassed, complete enlightenment, shall render the community of śrāvakas immeasurable and countless?

source: ཆོས་བསྟན་པ་གཅིག་གིས་སྟན་གཅིག་པའི་དགྲ་བཅོམ་པ་ནི་ཚད་མེད་གྲངས་མེད་པར་འགྱུར།
en: How is it that I, through a single teaching of the Dharma, shall render those who attain arhatship in a single sitting immeasurable and countless?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་འགྱུར།
en: How is it that I shall enable bodhisattva great beings to make irreversible progress toward unsurpassed, complete enlightenment?

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ནི་ཚད་མེད་གྲངས་མེད་པར་འགྱུར།
en: How is it that I shall render the community of bodhisattvas immeasurable and countless?

source: ཚེའི་ཚད་ནི་དཔག་ཏུ་མེད་པར་འགྱུར།
en: How is it that the limit of my lifespan will become inestimable?

source: འོད་དཔག་ཏུ་མེད་པ་ནི་ཕུན་སུམ་ཚོགས་པར་འགྱུར་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: How is it that my boundless light will be endowed with excellence?’ And when they think such thoughts, they should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་འདོད་ཆགས་དང་ཞེ་སྡང་དང་གཏི་མུག་གི་སྒྲ་ཡང་མི་གྲག་པར་བྱ་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings think, ‘How is it that when I have attained consummate buddhahood in unsurpassed, complete enlightenment, I shall ensure that in that buddhafield even the words attachment, aversion, and delusion are never heard?’ they should train in the perfection of wisdom. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་ཚེ། སངས་རྒྱས་ཀྱི་ཞིང་དེའི་སེམས་ཅན་ཐམས་ཅད་ལ་འདི་ལྟར་སྦྱིན་པ་ནི་དགེ་བའོ། །དུལ་བ་ནི་དགེ་བའོ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings think, ‘How is it that when I have attained consummate buddhahood in unsurpassed, complete enlightenment, all the beings of that buddhafield will have such wisdom that they know, “Generosity is virtuous!

source: །ཚངས་པའི་སྤྱོད་པ་ནི་དགེ་བའོ།
en: Chastity is virtuous!

source: །སྲོག་ཆགས་སུ་གྱུར་པ་ཐམས་ཅད་ལ་འཚེ་བ་མེད་པ་ནི་དགེ་བའོ་ཞེས་བྱ་བར་ཤེས་པའི་ཤེས་རབ་དེ་ལྟ་བུ་དང་ལྡན་པར་འགྱུར་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Nonviolence with respect to all living creatures is virtuous!”?’ they should train in the perfection of wisdom. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་། དམ་པའི་ཆོས་ནུབ་ཅེས་བྱ་བའི་སྒྲ་ཡང་མི་གྲག་པར་འགྱུར་སྙམ་ན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: Moreover, Śāradvatīputra, when bodhisattva great beings think, ‘How is it that, even after attaining final nirvāṇa, I shall ensure that even the words the decline of the Dharma are never heard?’ they should train in the perfection of wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཇི་ལྟར་ན་བདག་གི་མིང་ཐོས་པ་ཙམ་གྱིས། འཇིག་རྟེན་གྱི་ཁམས་གངྒཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཀྱི་སེམས་ཅན་མང་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ངེས་པར་འགྱུར་སྙམ་ན་ཡང་།
en: If bodhisattva great beings also think, ‘How is it that merely by hearing my name multitudes of beings in world systems numerous as the grains of sand of the river Gaṅgā will become settled in unsurpassed, complete enlightenment?’

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ།
en: they should train in the perfection of wisdom. {

source: །ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཡོན་ཏན་འདི་དག་བསྒྲུབ་པར་འགྱུར་བ་དེའི་ཚེ། རྒྱལ་པོ་ཆེན་པོ་བཞི་ཡང་གང་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་རྣམས་ལ། སྔོན་གྱི་རྒྱལ་པོ་ཆེན་པོ་རྣམས་ཀྱིས་ཕུལ་བའི་ལྷུང་བཟེད་རྣམས་བདག་ཅག་གིས་ཀྱང་འདི་ལ་དབུལ་བར་བྱའོ་ཞེས་དགའ་བར་འགྱུར་རོ།
en: Dt.35} “Śāradvatīputra, at that time when bodhisattva great beings practice the perfection of wisdom and accomplish these enlightened attributes, the Four Great Kings will also rejoice, saying, ‘We too will offer them the alms bowls that the great kings of the past offered to the tathāgatas of the past.’

source: །བདག་ཅག་གིས་འདི་ལ་རིམ་གྲོ་དང་བསྟི་སྟང་དུ་བྱའོ་ཞེས་སུམ་ཅུ་རྩ་གསུམ་པའི་ལྷ་རྣམས་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱང་དགའ་བར་འགྱུར་རོ།
en: The gods of the Trayastriṃśa realm and the gods of the Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms will also rejoice, saying, ‘We will serve and honor them.’

source: །དེ་ལྟར་ལྷ་མ་ཡིན་གྱི་རིས་རྣམས་ནི་འགྲིབ་པར་འགྱུར།
en: The gods of Brahmakāyika and the gods of Ābhāsvara, Śubhakṛtsna, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha will also rejoice, saying, ‘The realms of the asuras will decline!

source: ལྷའི་རིས་རྣམས་ནི་འཕེལ་བར་འགྱུར་ཏེ།
en: The realms of the gods will flourish!

source: འདི་མངོན་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་དོན་དུ་བདག་ཅག་གིས་གསོལ་བ་གདབ་པར་བྱའོ་ཞེས་ཚངས་རིས་ཀྱི་ལྷ་རྣམས་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་རྒྱས་དང་། འབྲས་བུ་ཆེ་བ་དང་མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱང་དགའ་བར་འགྱུར་རོ། །ཤ་ར་དྭ་ཏིའི་བུ་གང་གི་ཚེ།
en: We pray that after these bodhisattvas have attained manifest buddhahood they will turn the wheel of the Dharma!’ “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་གིས་རྣམ་པར་འཕེལ་བར་འགྱུར་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་རྣམས་ཀྱང་། བདག་ཅག་ནི་སེམས་ཅན་ཆེན་པོ་འདིའི་ཕ་དང་མ་དང་ཕུ་ནུ་དང་། སྲིང་མོ་དང་། ཆུང་མ་དང་། བུ་དང་བུ་མོ་དང་མཛའ་བོ་དང་བློན་པོ་དང་གཉེན་བཤེས་དང་གྲོགས་པོ་དང་བཤེས་པར་འགྱུར་རོ་སྙམ་སྟེ། དགའ་བར་འགྱུར་རོ།
en: Śāradvatīputra, at that time when bodhisattva great beings practice the perfection of wisdom and flourish through the six perfections, the noble sons and noble daughters who follow the vehicle of the bodhisattvas will also rejoice, saying, ‘We will become their father, mother, brother, sister, wife, son, daughter, confidant, advisor, relative, acquaintance, and friend.’ {

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལ་བཙུན་མོའི་འཁོར་དབུལ་ལོ་ཞེས། རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞིའི་རིས་ཀྱི་ལྷ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། འོག་མིན་གྱི་ལྷ་རྣམས་ཀྱང་དགའ་བར་འགྱུར་ཏེ།
en: Dt.36} “The Four Great Kings, the gods of the Caturmahā­rāja­kāyika realm, and the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, and Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha will also rejoice, saying, ‘This bodhisattva great being has given up his entourage of queens.’ “

source: དེ་ནི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ལ་འགོད་པའི་ཕྱིར་ཚངས་པར་སྤྱོད་པ་ཡིན་ཏེ།
en: In order to establish beings in enlightenment, they maintain chaste conduct.

source: འདུ་བའི་ཆོས་རྣམས་ཀྱིས་ཡོངས་སུ་བསྡུ་བ་མ་ཡིན་ནོ།
en: They are not bound by fettering concerns.

source: །དེ་ནི་འདི་ལྟར་སྨོན་ཏེ་བདག་གིས་སེམས་དང་པོ་བསྐྱེད་ནས་ཚངས་པར་སྤྱད་དེ། ཚངས་པར་མི་སྤྱོད་པ་མེད་པར་བྱའོ།
en: They aspire that they might maintain chaste conduct from the time when they first begin to set their mind on enlightenment onward, and that they might avoid all conduct that is not chaste.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདོད་པ་ལ་བསྟེན་པ་ནི། ཚངས་པའི་འཇིག་རྟེན་དུ་སྐྱེ་བ་ལ་ཡང་བར་དུ་གཅོད་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ལྟ་ཅི་སྨོས།
en: If you ask why, since the pursuit of sensual pleasures may even interrupt rebirth in the Brahmā worlds, what need one say about unsurpassed, complete enlightenment!

source: དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་མངོན་པར་བྱུང་ནས་ཚངས་པར་སྤྱད་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའི།
en: Therefore, bodhisattva great beings who maintain chaste conduct from the time when they renounce the world will attain consummate buddhahood in unsurpassed, complete enlightenment.

source: ཚངས་པར་མི་སྤྱོད་པར་མི་བྱའོ།
en: They will not do so with conduct that is not chaste.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །ཅི་ལགས། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ཕ་དང་། མ་དང་མཆིས་བྲང་དང་བུ་དང་བུ་མོ་གདོན་མི་འཚལ་བར་འཚལ་ལམ།
en: The venerable Śāradvatīputra then asked the Blessed One, “Blessed Lord, is it definite that bodhisattva great beings will have a father, mother, wife, sons, and daughters?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ལ་ལ་ནི་ཕ་དང་མ་གདོན་མི་ཟ་བར་དགོས་ཀྱི་བུ་དང་བུ་མོ་དང་ཆུང་མ་མི་དགོས་སོ།
en: Śāradvatīputra,” replied the Blessed One, “there are some bodhisattva great beings who definitely need to have a father and mother, but who do not need to have sons, daughters, and wives.

source: །ལ་ལ་ལ་ནི་ཕ་དང་མ་དང་ཆུང་མ་དང་བུ་དང་བུ་མོ་དག་ཀྱང་གདོན་མི་ཟ་བར་དགོས་སོ།
en: There are some who definitely need to have a father and mother, and also wives, sons, and daughters.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ལ་ནི་སེམས་དང་པོ་བསྐྱེད་ཕྱིན་ཆད་ཚངས་པར་སྤྱོད་པ་ཡང་དག་པར་ལེན་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཀྱི་བར་དུ་གཞོན་ནུར་གྱུར་པར་འཁོད་དོ།
en: Śāradvatīputra, there are some bodhisattva great beings who maintain chaste conduct from the time when they first begin to set their mind on enlightenment onward, and who live as youthful ones until they have attained consummate buddhahood in unsurpassed, complete enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ལ་ནི་ཐབས་མཁས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་ཡོངས་སུ་སྤྱད་དེ།
en: There are some bodhisattva great beings who have engaged in the pleasures of the five senses in order to bring beings to maturation through skillful means.

source: ཆུང་མའི་འཁོར་གྱི་ནང་ནས་མངོན་པར་བྱུང་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་འཚང་རྒྱའོ།
en: After leaving the family circle behind, they then attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་ལ་རྣམ་པར་སྤྱོད་པ། འདོད་པའི་ཉོན་མོངས་པ་དང་བྲལ་བ།
en: Śāradvatīputra, bodhisattva great beings who practice the profound perfection of wisdom are without the afflicted mental states associated with desire.

source: ལ་ལ་ནི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། འདོད་པའི་ཡོན་ཏན་ལ་ཡོངས་སུ་སྤྱོད་པ་ཡང་སྟོན་ཏེ་ཉམས་ཀྱིས་ཡོངས་སུ་སྤྱོད་པ་མེད་དོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན། སྒྱུ་མའི་མཁན་པོ་འམ།
en: Although some of them may engage in the pleasures of the senses in order to bring beings to maturation, they display this activity but do not relish it. {

source: སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་མཁས་པ། སྒྱུ་མའི་སྔགས་དང་སྦྱོར་ཐབས་ཀྱི་ཚུལ་ལ་ཤིན་ཏུ་བསླབས་པ་དེ་ལྟ་བུ་ཞིག་གིས། འདོད་པའི་ཡོན་ཏན་ལྔ་མངོན་པར་སྤྲུལ་ཏེ། འདོད་པའི་ཡོན་ཏན་ལྔ་པོ་དེ་དག་ལ་བདག་ཉིད་རྩེ་ཞིང་དགའ་བ་དང་ཡོངས་སུ་སྤྱོད་པ་བསྟན་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། སྒྱུ་མའི་མཁན་པོ་དང་། སྒྱུ་མའི་མཁན་པོའི་མཆན་བུ་དེས་འདོད་པའི་ཡོན་ཏན་ལྔ་ལ་ཡོངས་སུ་སྤྱོད་པ་ཡོད་དམ།
en: Dt.37} Śāradvatīputra, if, as an analogy, an illusionist or the apprentice of an illusionist extremely well trained in magical spells and techniques were to conjure the five pleasures of the senses, and were then to reveal himself playing with, delighting in, and enjoying those five pleasures of the senses, do you think, Śāradvatīputra, that that illusionist or apprentice of an illusionist would have actually enjoyed the five pleasures of the senses?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟ་བུ་མ་མཆིས་སོ།
en: He would not, Blessed Lord!” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐེག་པ་ཆེན་པོའི་སྒྱུ་མ་ལ་ཤིན་ཏུ་བསླབས་པ། ཆོས་ཉིད་སྒྱུ་མ་ལྟ་བུས་རྣམ་པར་སྤྱོད་པ་རབ་ཏུ་ཐོབ་པ།
en: In the same way, Śāradvatīputra,” continued the Blessed One, “bodhisattva great beings who have trained extremely well in the magical display of the Great Vehicle acquire the ability to enjoy reality as a magical display.

source: ཉོན་མོངས་པ་ཐམས་ཅད་དང་བྲལ་བ་དག་ཀྱང་། འདུལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། སྙིང་རྗེ་ཆེན་པོའི་དབང་གིས་འདོད་པའི་ཡོན་ཏན་ལ་ཡོངས་སུ་སྤྱོད་པ་ཡང་སྟོན་ཏེ།
en: Although they are free from all afflicted mental states, in order to bring beings who are to be trained to maturation they may also teach the enjoyment of the pleasures of the senses by the power of their great compassion.

source: དེ་དག་དེ་དང་འགྲོགས་པ་ཡང་མེད། དེས་འགྲོ་བར་འགྱུར་བ་ཡང་མེད་དོ།
en: They neither associate with those pleasures nor are they propelled toward them.

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ནི་རྣམ་གྲངས་དུ་མས་འདོད་པ་རྣམས་ལ་སྐྱོན་དུ་བརྗོད་དེ། འདོད་པ་རྣམས་ནི་ཀུན་ནས་འབར་བའོ།
en: Śāradvatīputra, bodhisattva great beings speak of the defects of attachments using many descriptive expressions: ‘Attachments are all ablaze!

source: །འདོད་པ་རྣམས་ནི་རབ་ཏུ་སྨད་པའོ།
en: Attachments are debased!

source: །འདོད་པ་རྣམས་ནི་གསོད་པའོ།
en: Attachments are murderous!

source: །འདོད་པ་རྣམས་ནི་དགྲའོ།
en: Attachments are inimical!

source: །འདོད་པ་རྣམས་ནི་ཕྱིར་རྒོལ་བའོ།
en: Attachments are aggressive!

source: །འདོད་པ་རྣམས་ནི་རྩྭའི་སྒྲོན་མ་ལྟ་བུའོ།
en: Attachments are like a lamp of straw!

source: །འདོད་པ་རྣམས་ནི་ཀིམ་པ་ཀའི་འབྲས་བུ་ལྟ་བུའོ།
en: Attachments are like the fruit of the snake gourd!

source: །འདོད་པ་རྣམས་ནི་རལ་གྲིའི་སོ་ལྟ་བུའོ།
en: Attachments are like the blade of a sword!

source: །འདོད་པ་རྣམས་ནི་མེ་མདག་སྤུངས་པ་ལྟ་བུའོ།
en: Attachments are like a mass of fire!

source: །འདོད་པ་རྣམས་ནི་དུག་གི་ལོ་མ་ལྟ་བུའོ།
en: Attachments are like smoldering leaves! Attachments are like an iron hook!

source: །འདོད་པ་རྣམས་ནི་མཆིལ་པ་ལྟ་བུའོ།
en: Attachments are like a cesspit!’

source: །འདོད་པ་རྣམས་ནི་མི་གཙང་བའི་རླུབས་ལྟ་བུའོ་ཞེས་དེ་ལྟར་ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འདོད་པ་རྣམས་ཡོངས་སུ་ཤེས་ཀྱང་སེམས་ཅན་ཐབས་མཁས་པ་མ་ཡིན་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དོན་དུ་འདོད་པའི་ཡོན་ཏན་ལྔ་ལས་སྐྱོ་བར་བྱ་བ་དང་། འདོད་པའི་ཡོན་ཏན་ལྔ་དང་བྲལ་བའི་ཕྱིར་འདོད་པའི་ཡོན་ཏན་ལྔ་ཉེ་བར་སྟོན་ཏེ།
en: So it is, Śāradvatīputra, that although bodhisattva great beings understand attachments, in order that unskilled beings might be brought to maturation, they may teach the sensual pleasures since they are disillusioned with the five sensual pleasures and free of the five sensual pleasures.

source: དེ་དག་གིས་མྱོས་པར་འགྱུར་བ་ཡང་མེད། བག་མེད་པར་འགྱུར་བ་ཡང་མེད། འདོད་པའི་རྒྱུ་དང་འདོད་པའི་གཞིས་སྡིག་ཏོའི་ལས་བྱེད་པར་འགྱུར་བ་ཡང་མེད་དོ།
en: They neither become intoxicated, nor do they become careless, nor do they engage in negative actions by reason of attachment or on the basis of attachment.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བགྱི།
en: The venerable Śāradvatīputra then asked the Blessed One, “Blessed Lord, how should bodhisattva great beings practice the perfection of wisdom?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Śāradvatīputra,” replied the Blessed One, “in this regard, when bodhisattva great beings practice the perfection of wisdom, they do not observe a bodhisattva.

source: །བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe the term bodhisattva.

source: །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe the conduct of a bodhisattva.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe the perfection of wisdom.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མིང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe the term perfection of wisdom.

source: །སྤྱོད་ཅེས་བྱ་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །མི་སྤྱོད་ཅེས་བྱ་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སྤྱོད་པ་དང་མི་སྤྱོད་པ་ཞེས་བྱ་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །སྤྱོད་པ་ཡང་མ་ཡིན་མི་སྤྱོད་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བར་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe the term practicing, and neither do they observe not practicing, nor observe both practicing and not practicing, nor even observe neither practicing nor not practicing.

source: །གཟུགས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They also do not observe physical form.

source: །ཚོར་བ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe feelings.

source: །འདུ་ཤེས་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe perceptions.

source: །འདུ་བྱེད་ཀྱང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe formative predispositions.

source: །རྣམ་པར་ཤེས་པ་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Nor do they observe consciousness. {

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཤ་ར་དྭ་ཏིའི་བུ་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཡང་བྱང་ཆུབ་སེམས་དཔའི་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: Dt.38} If you ask why, Śāradvatīputra, it is because even bodhisattvas are empty of the inherent existence of bodhisattvas.

source: །བྱང་ཆུབ་སེམས་དཔའི་མིང་ཡང་བྱང་ཆུབ་སེམས་དཔའི་མིང་གིས་སྟོང་ངོ་།
en: Even the term bodhisattva is empty of the term bodhisattva.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེའི་རང་བཞིན་ནི་དེ་ཡིན་ཏེ།
en: If you ask why, it is because such is their intrinsic nature.

source: དེ་ནི་འདི་ལྟར་སྟོང་པ་ཉིད་ཀྱིས་གཟུགས་སྟོང་པ་མ་ཡིན། གཟུགས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ།
en: It is not owing to emptiness that physical forms are empty, nor is emptiness anything other than physical forms.

source: གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: The nature of physical forms is indeed emptiness.

source: །སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ།
en: Emptiness is indeed physical forms.

source: །སྟོང་པ་ཉིད་ཀྱིས་ཚོར་བ་སྟོང་པ་མ་ཡིན། ཚོར་བ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ།
en: It is not owing to emptiness that feelings are empty, nor is emptiness anything other than feelings.

source: ཚོར་བ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: The nature of feelings is indeed emptiness.

source: །སྟོང་པ་ཉིད་ཀྱང་ཚོར་བའོ།
en: Emptiness is indeed feelings.

source: །སྟོང་པ་ཉིད་ཀྱིས་འདུ་ཤེས་སྟོང་པ་མ་ཡིན། འདུ་ཤེས་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ།
en: It is not owing to emptiness that perceptions are empty, nor is emptiness anything other than perceptions.

source: འདུ་ཤེས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: The nature of perceptions is indeed emptiness.

source: །སྟོང་པ་ཉིད་ཀྱང་འདུ་ཤེས་སོ།
en: Emptiness is indeed perceptions.

source: །སྟོང་པ་ཉིད་ཀྱིས་འདུ་བྱེད་སྟོང་པ་མ་ཡིན། འདུ་བྱེད་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ།
en: It is not owing to emptiness that formative predispositions are empty, nor is emptiness anything other than formative predispositions.

source: འདུ་བྱེད་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: The nature of formative predispositions is indeed emptiness.

source: །སྟོང་པ་ཉིད་ཀྱང་འདུ་བྱེད་དོ།
en: Emptiness is indeed formative predispositions.

source: །སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པར་ཤེས་པ་སྟོང་པ་མ་ཡིན། རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་སྟོང་པ་ཉིད་མེད་དེ།
en: It is not owing to emptiness that consciousness is empty, nor is emptiness anything other than consciousness.

source: རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་སྟོང་པ་ཉིད་དོ།
en: The nature of consciousness is indeed emptiness.

source: །སྟོང་པ་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: Emptiness is indeed consciousness.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟ་སྟེ། བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ཡང་མིང་ཙམ་མོ།
en: If you ask why, it is because even enlightenment is merely a name.

source: །འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བྱ་བ་འདི་ཡང་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ།
en: Likewise, even bodhisattva is merely a name.

source: སྟོང་པ་ཉིད་ཅེས་བྱ་བ་འདི་ཡང་མིང་ཙམ་མོ། །འདི་ལྟ་སྟེ།
en: Even emptiness is merely a name.

source: གཟུགས་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འདི་ཡང་མིང་ཙམ་མོ།
en: Likewise, even these—physical forms, feelings, perceptions, formative predispositions, and consciousness—are merely names. “

source: །དེ་ཡང་འདི་ལྟར་གཟུགས་ནི་སྒྱུ་མ་ལྟ་བུའོ།
en: Moreover, physical forms are like a magical display.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ནི་སྒྱུ་མ་ལྟ་བུའོ།
en: Feelings, perceptions, formative predispositions, and consciousness are like a magical display.

source: །སྒྱུ་མ་ནི་མིང་ཙམ་སྟེ།
en: Magical displays are merely names.

source: ཕྱོགས་ན་གནས་པ་ཡང་མ་ཡིན། ཡུལ་ན་གནས་པ་ཡང་མ་ཡིན་པས།
en: They are not located in any direction, nor are they located in any place.

source: སྒྱུ་མ་མཐོང་བ་ནི་ཡོད་པ་མ་ཡིན་ཏེ།
en: Magical displays that are seen do not exist.

source: བྱུང་བ་མ་ཡིན།
en: They have not arisen.

source: ལོག་པར་གྱུར་པ། རང་བཞིན་མེད་པ།
en: They are false.

source: ངོ་བོ་ཉིད་མེད་པ། མ་སྐྱེས་པ།
en: They are without inherent existence.

source: མ་འགགས་པ། གནས་མེད་པ། འཕེལ་བ་མེད་པ། འགྲིབ་པ་མེད་པ། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ།
en: They are without essential nature, nonarising, nonceasing, nondwelling, without increase, without decrease, without affliction, and without purification.

source: རྣམ་པར་བྱང་བ་མེད་པ་སྟེ། དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཆོས་གང་ཡང་སྐྱེ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Bodhisattva great beings who practice accordingly do not observe any phenomenon that arises.

source: །འགག་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything that ceases.

source: །གནས་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything that remains.

source: །འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: They do not observe anything that increases.
